; 初始化计数器 0
; 36h = 00110110b 即选择计数器 0，方式 3(方波)，二进制计数
mov al, 36h
; 写入控制寄存器
out 43h, al
; 设置计数器的初值为 65536，即 0
mov al, 0
; 写入初值低位
out 40h, al
; 写入初值高位
out 40h, al

; --------------------------------------------------------
; 初始化计数器 1
; 54h = 01010100b 即选择计数器 1，方式 2(频率发生器)，二进制计数
mov al, 54h
; 写入控制寄存器
out 43h, al
; 写入计数器初值 18
mov al, 18
out 41h, al

; ---------------------------------------------------------
; 初始化计数器 2
; 0b6h = 10110110b 即选择计数器 2，方式 3(方波)，二进制计数
mov al, 0b6h
; 写入控制寄存器
out 43h, al
; 计数器初值
mov ax, 0533h
; 对应 896HZ 的发声频率
out 42h, al
mov al, ah
out 42h, al
; 取 8255 PB 口
; 扬声器的发声受 8255 PB0 和 PB1 的控制
in al, 61h
; 在 ah 暂存
mov ah, al
; 使 PB1 = PB0 = 1
or al, 03
; 使扬声器发声
out 61h, al
; ... 略
; 恢复 PB 口
mov al, ah
out 61h, al